import React from 'react'
import { ArrowUpRight } from "lucide-react";

import service1 from "../assets/checkup-two.jpg";
import service2 from "../assets/checkup-three.jpg";
import service3 from "../assets/checkup-one.jpg";
import { Link } from 'react-router-dom';

export const services = [
  {
    id: 1,
    slug: "diabetes-chronic-disease-treatment",
    title: "ডায়াবেটিস ও দীর্ঘমেয়াদি রোগের চিকিৎসা",
    description:
      "ডায়াবেটিস, উচ্চ রক্তচাপ, থাইরয়েডসহ বিভিন্ন দীর্ঘমেয়াদি রোগের নিয়মিত চিকিৎসা ও ফলো-আপ সেবা।",

    longDescription:
      "ডায়াবেটিস ও দীর্ঘমেয়াদি রোগের সঠিক ও নিয়মিত চিকিৎসা রোগীর সুস্থ ও স্বাভাবিক জীবনযাপনের জন্য অত্যন্ত গুরুত্বপূর্ণ। আমাদের ক্লিনিকে অভিজ্ঞ চিকিৎসকের তত্ত্বাবধানে ডায়াবেটিস, উচ্চ রক্তচাপ, থাইরয়েড, কিডনি-সংক্রান্ত সমস্যা, লিভারের দীর্ঘমেয়াদি রোগ, স্থূলতা এবং অন্যান্য ক্রনিক রোগের আধুনিক ও বৈজ্ঞানিক চিকিৎসা প্রদান করা হয়। প্রতিটি রোগীর শারীরিক অবস্থা, পূর্বের চিকিৎসার ইতিহাস এবং বর্তমান স্বাস্থ্য পরিস্থিতি বিশ্লেষণ করে একটি ব্যক্তিগত চিকিৎসা পরিকল্পনা তৈরি করা হয়। প্রয়োজন অনুযায়ী রক্ত পরীক্ষা, সুগার প্রোফাইল, HbA1c, লিপিড প্রোফাইল, থাইরয়েড ফাংশন টেস্ট, কিডনি ও লিভারের বিভিন্ন পরীক্ষা করার পরামর্শ দেওয়া হয়। শুধু ওষুধ প্রদান নয়, রোগ নিয়ন্ত্রণে রাখতে সঠিক খাদ্যাভ্যাস, নিয়মিত ব্যায়াম, ওজন নিয়ন্ত্রণ, মানসিক চাপ কমানো এবং স্বাস্থ্যকর জীবনধারা অনুসরণের জন্য বিস্তারিত পরামর্শ প্রদান করা হয়। নিয়মিত ফলো-আপের মাধ্যমে রোগের অগ্রগতি পর্যবেক্ষণ করা হয় এবং প্রয়োজনে চিকিৎসা পরিকল্পনায় পরিবর্তন আনা হয়। আমাদের লক্ষ্য হলো রোগকে দীর্ঘমেয়াদে নিয়ন্ত্রণে রাখা, জটিলতা প্রতিরোধ করা এবং রোগীর জীবনমান উন্নত করা।",

    details:
      "আমরা ডায়াবেটিস, উচ্চ রক্তচাপ, থাইরয়েড এবং অন্যান্য দীর্ঘমেয়াদি রোগের আধুনিক চিকিৎসা প্রদান করি।",
    image: service1,
  },

  {
    id: 2,
    slug: "general-health-checkup",
    title: "সাধারণ স্বাস্থ্য পরীক্ষা",
    description:
      "সম্পূর্ণ স্বাস্থ্য মূল্যায়ন, রোগ নির্ণয়, প্রয়োজনীয় পরীক্ষা-নিরীক্ষার পরামর্শ এবং চিকিৎসা প্রদান।",

    longDescription:
      "সাধারণ স্বাস্থ্য পরীক্ষা সুস্থ জীবনযাপনের অন্যতম গুরুত্বপূর্ণ অংশ। নিয়মিত স্বাস্থ্য পরীক্ষার মাধ্যমে অনেক জটিল রোগ প্রাথমিক পর্যায়েই শনাক্ত করা সম্ভব হয়, যা ভবিষ্যতে বড় ধরনের স্বাস্থ্যঝুঁকি এড়াতে সাহায্য করে। আমাদের স্বাস্থ্য পরীক্ষা সেবায় রোগীর সম্পূর্ণ শারীরিক অবস্থা মূল্যায়ন করা হয় এবং প্রয়োজন অনুযায়ী রক্তচাপ, রক্তের সুগার, কোলেস্টেরল, লিভার ও কিডনির কার্যকারিতা, থাইরয়েড, রক্তস্বল্পতা, ইউরিক অ্যাসিডসহ বিভিন্ন পরীক্ষা-নিরীক্ষার পরামর্শ দেওয়া হয়। পরীক্ষার ফলাফল বিশ্লেষণ করে রোগ নির্ণয়, চিকিৎসা পরিকল্পনা এবং ভবিষ্যতে সুস্থ থাকার জন্য প্রয়োজনীয় স্বাস্থ্য নির্দেশনা প্রদান করা হয়। এছাড়াও রোগীর বয়স, পারিবারিক রোগের ইতিহাস এবং জীবনধারার ওপর ভিত্তি করে ব্যক্তিগত স্বাস্থ্য পরিকল্পনা তৈরি করা হয়। আমাদের লক্ষ্য হলো রোগ প্রতিরোধ, দ্রুত শনাক্তকরণ এবং দীর্ঘমেয়াদে সুস্থ জীবন নিশ্চিত করা।",

    details:
      "সম্পূর্ণ স্বাস্থ্য মূল্যায়নের মাধ্যমে রোগীর শারীরিক অবস্থা পর্যালোচনা করা হয়।",
    image: service2,
  },

  {
    id: 3,
    slug: "heart-disease-high-blood-pressure-treatment",
    title: "হৃদরোগ ও উচ্চ রক্তচাপের চিকিৎসা",
    description:
      "উচ্চ রক্তচাপ, বুকের ব্যথা, হৃদরোগের ঝুঁকি মূল্যায়ন এবং প্রয়োজনীয় চিকিৎসা ও পরামর্শ।",

    longDescription:
      "হৃদরোগ এবং উচ্চ রক্তচাপ বর্তমানে বিশ্বব্যাপী মৃত্যুর অন্যতম প্রধান কারণ। সময়মতো রোগ নির্ণয় এবং সঠিক চিকিৎসার মাধ্যমে এই রোগগুলো সফলভাবে নিয়ন্ত্রণ করা সম্ভব। আমাদের ক্লিনিকে রোগীর শারীরিক অবস্থা, পারিবারিক ইতিহাস, জীবনধারা এবং উপসর্গ মূল্যায়ন করে প্রয়োজনীয় চিকিৎসা প্রদান করা হয়। বুকের ব্যথা, শ্বাসকষ্ট, অনিয়মিত হৃদস্পন্দন, উচ্চ রক্তচাপ এবং হৃদরোগের অন্যান্য লক্ষণের জন্য আধুনিক চিকিৎসা ও পরামর্শ দেওয়া হয়। প্রয়োজন অনুযায়ী ইসিজি (ECG), ইকোকার্ডিওগ্রাম, রক্ত পরীক্ষা এবং অন্যান্য প্রয়োজনীয় পরীক্ষা-নিরীক্ষার পরামর্শ প্রদান করা হয়। রোগীর জন্য উপযুক্ত ওষুধ নির্বাচন, নিয়মিত রক্তচাপ পর্যবেক্ষণ, খাদ্যাভ্যাস পরিবর্তন, লবণ ও চর্বি নিয়ন্ত্রণ, নিয়মিত ব্যায়াম এবং ধূমপান বর্জনের মতো গুরুত্বপূর্ণ স্বাস্থ্য পরামর্শ দেওয়া হয়। নিয়মিত ফলো-আপের মাধ্যমে চিকিৎসার অগ্রগতি মূল্যায়ন করা হয় এবং রোগীর হৃদযন্ত্রকে সুস্থ রাখতে দীর্ঘমেয়াদি চিকিৎসা পরিকল্পনা অনুসরণ করা হয়।",

    details:
      "উচ্চ রক্তচাপ, বুকের ব্যথা এবং হৃদরোগের বিভিন্ন সমস্যার আধুনিক চিকিৎসা প্রদান করা হয়।",
    image: service3,
  },
];

const HomeServiceSection = () => {
    return (
        <section className="py-10 bg-white">
            <div className="max-w-7xl mx-auto px-6">

                {/* Heading */}
                <div className="flex flex-col md:flex-row justify-between items-center mb-14">
                    <div>
                        <h2 className="text-5xl font-bold">
                            আমার চিকিৎসা সেবা
                        </h2>

                        <p className="text-gray-500 mt-4 text-lg">
                            রোগ নির্ণয় থেকে শুরু করে দীর্ঘমেয়াদি চিকিৎসা ও স্বাস্থ্য পরামর্শ—সবকিছুই একজন অভিজ্ঞ মেডিসিন বিশেষজ্ঞের তত্ত্বাবধানে।
                        </p>
                    </div>
                </div>

                {/* Cards */}
                <div className="grid lg:grid-cols-3 gap-8">
                    {services.map((service, index) => (
                        <Link  onClick={() => window.scrollTo(0, 0)}  key={service.id} to={`/services/${service.slug}`} className="bg-[#dfe9ff] rounded-[28px] overflow-hidden hover:shadow-2xl transition-all duration-300 hover:-translate-y-2 cursor-pointer"
                        >
                        {/* Top */}
                            <div className="p-7">
                                <div className="flex justify-between items-start gap-4">
                                    <div>
                                        <h3 className="text-3xl font-semibold leading-tight">
                                        {service.title}
                                        </h3>

                                        <p className="text-gray-600 mt-5 leading-7">
                                        {service.description}
                                        </p>
                                    </div>

                                    <button className="w-14 h-14 rounded-full bg-white flex justify-center items-center shrink-0 hover:bg-blue-600 hover:text-white transition">
                                        <ArrowUpRight size={26} />
                                    </button>
                                </div>
                            </div>

                            {/* Image */}
                            <div className="px-3 pb-3">
                                <img
                                src={service.image}
                                alt={service.title}
                                className="w-full h-[320px] object-cover rounded-[24px]"
                                />
                            </div>
                        </Link>
                    ))}
                </div>
            </div>
        </section>
    )
}

export default HomeServiceSection